Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_eddsa_type.h
/**************************************************************************//**
 * @defgroup EDDSA_ENG_Y2_P4_REG
 * @brief  EdDSA Engine Y2 Point [159:128] Registers (@ 0X080)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_Y2_P4                        0
#define EDDSA_MASK_ENG_Y2_P4                         ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [159:128] of an input point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_Y2_P5_REG
 * @brief  EdDSA Engine Y2 Point [191:160] Registers (@ 0X084)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_Y2_P5                        0
#define EDDSA_MASK_ENG_Y2_P5                         ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [191:160] of a input point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_Y2_P6_REG
 * @brief  EdDSA Engine Y2 Point [223:192] Registers (@ 0X088)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_Y2_P6                        0
#define EDDSA_MASK_ENG_Y2_P6                         ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [223:192] of an input point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_Y2_P7_REG
 * @brief  EdDSA Engine Y2 Point [255:224] Registers (@ 0X08C)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_Y2_P7                        0
#define EDDSA_MASK_ENG_Y2_P7                         ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [255:224] of a input point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P0_REG
 * @brief  EdDSA Engine X1 Output Point [31:0] Registers (@ 0X090)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P0                       0
#define EDDSA_MASK_ENG_XO1_P0                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [31:0] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P1_REG
 * @brief  EdDSA Engine X1 Output Point [63:32] Registers (@ 0X094)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P1                       0
#define EDDSA_MASK_ENG_XO1_P1                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [63:32] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P2_REG
 * @brief  EdDSA Engine X1 Output Point [95:64] Registers (@ 0X098)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P2                       0
#define EDDSA_MASK_ENG_XO1_P2                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [95:64] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P3_REG
 * @brief  EdDSA Engine X1 Output Point [127:96] Registers (@ 0X09C)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P3                       0
#define EDDSA_MASK_ENG_XO1_P3                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [127:96] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P4_REG
 * @brief  EdDSA Engine X1 Output Point [159:128] Registers (@ 0X0A0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P4                       0
#define EDDSA_MASK_ENG_XO1_P4                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [159:128] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P5_REG
 * @brief  EdDSA Engine X1 Ouput Point [191:160] Registers (@ 0X0A4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P5                       0
#define EDDSA_MASK_ENG_XO1_P5                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [191:160] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P6_REG
 * @brief  EdDSA Engine X1 Output Point [223:192] Registers (@ 0X0A8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P6                       0
#define EDDSA_MASK_ENG_XO1_P6                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [223:192] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO1_P7_REG
 * @brief  EdDSA Engine X1 Output Point [255:224] Registers (@ 0X0AC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO1_P7                       0
#define EDDSA_MASK_ENG_XO1_P7                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X1 value [255:224] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P0_REG
 * @brief  EdDSA Engine Y1 Output Point [31:0] Registers (@ 0X0B0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P0                       0
#define EDDSA_MASK_ENG_YO1_P0                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [31:0] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P1_REG
 * @brief  EdDSA Engine Y1 Output Point [63:32] Registers (@ 0X0B4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P1                       0
#define EDDSA_MASK_ENG_YO1_P1                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [63:32] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P2_REG
 * @brief  EdDSA Engine Y1 Output Point [95:64] Registers (@ 0X0B8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P2                       0
#define EDDSA_MASK_ENG_YO1_P2                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [95:64] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P3_REG
 * @brief  EdDSA Engine Y1 Output Point [127:96] Registers (@ 0X0BC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P3                       0
#define EDDSA_MASK_ENG_YO1_P3                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [127:96] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P4_REG
 * @brief  EdDSA Engine Y1 Output Point [159:128] Registers (@ 0X0C0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P4                       0
#define EDDSA_MASK_ENG_YO1_P4                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [159:128] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P5_REG
 * @brief  EdDSA Engine Y1 Ouput Point [191:160] Registers (@ 0X0C4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P5                       0
#define EDDSA_MASK_ENG_YO1_P5                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [191:160] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P6_REG
 * @brief  EdDSA Engine Y1 Output Point [223:192] Registers (@ 0X0C8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P6                       0
#define EDDSA_MASK_ENG_YO1_P6                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [223:192] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO1_P7_REG
 * @brief  EdDSA Engine Y1 Output Point [255:224] Registers (@ 0X0CC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO1_P7                       0
#define EDDSA_MASK_ENG_YO1_P7                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y1 value [255:224] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P0_REG
 * @brief  EdDSA Engine X2 Output Point [31:0] Registers (@ 0X0D0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P0                       0
#define EDDSA_MASK_ENG_XO2_P0                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [31:0] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P1_REG
 * @brief  EdDSA Engine X2 Output Point [63:32] Registers (@ 0X0D4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P1                       0
#define EDDSA_MASK_ENG_XO2_P1                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [63:32] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P2_REG
 * @brief  EdDSA Engine X2 Output Point [95:64] Registers (@ 0X0D8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P2                       0
#define EDDSA_MASK_ENG_XO2_P2                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [95:64] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P3_REG
 * @brief  EdDSA Engine X2 Output Point [127:96] Registers (@ 0X0DC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P3                       0
#define EDDSA_MASK_ENG_XO2_P3                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [127:96] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P4_REG
 * @brief  EdDSA Engine X2 Output Point [159:128] Registers (@ 0X0E0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P4                       0
#define EDDSA_MASK_ENG_XO2_P4                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [159:128] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P5_REG
 * @brief  EdDSA Engine X2 Ouput Point [191:160] Registers (@ 0X0E4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P5                       0
#define EDDSA_MASK_ENG_XO2_P5                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [191:160] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P6_REG
 * @brief  EdDSA Engine X2 Output Point [223:192] Registers (@ 0X0E8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P6                       0
#define EDDSA_MASK_ENG_XO2_P6                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [223:192] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_XO2_P7_REG
 * @brief  EdDSA Engine X2 Output Point [255:224] Registers (@ 0X0EC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_XO2_P7                       0
#define EDDSA_MASK_ENG_XO2_P7                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  X2 value [255:224] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P0_REG
 * @brief  EdDSA Engine Y2 Output Point [31:0] Registers (@ 0X0F0)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P0                       0
#define EDDSA_MASK_ENG_YO2_P0                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [31:0] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P1_REG
 * @brief  EdDSA Engine Y2 Output Point [63:32] Registers (@ 0X0F4)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P1                       0
#define EDDSA_MASK_ENG_YO2_P1                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [63:32] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P2_REG
 * @brief  EdDSA Engine Y2 Output Point [95:64] Registers (@ 0X0F8)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P2                       0
#define EDDSA_MASK_ENG_YO2_P2                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [95:64] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P3_REG
 * @brief  EdDSA Engine Y2 Output Point [127:96] Registers (@ 0X0FC)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P3                       0
#define EDDSA_MASK_ENG_YO2_P3                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [127:96] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P4_REG
 * @brief  EdDSA Engine Y2 Output Point [159:128] Registers (@ 0X100)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P4                       0
#define EDDSA_MASK_ENG_YO2_P4                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [159:128] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P5_REG
 * @brief  EdDSA Engine Y2 Ouput Point [191:160] Registers (@ 0X104)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P5                       0
#define EDDSA_MASK_ENG_YO2_P5                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [191:160] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P6_REG
 * @brief  EdDSA Engine Y2 Output Point [223:192] Registers (@ 0X108)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P6                       0
#define EDDSA_MASK_ENG_YO2_P6                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [223:192] of an output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_YO2_P7_REG
 * @brief  EdDSA Engine Y2 Output Point [255:224] Registers (@ 0X10C)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_ENG_YO2_P7                       0
#define EDDSA_MASK_ENG_YO2_P7                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Y2 value [255:224] of a output point. */
/** @} */

/**************************************************************************//**
 * @defgroup EDDSA_ENG_DBG_OUTPUT_REG
 * @brief  EdDSA Engine Debug Output Register        (@ 0X200)
 * @{
 *****************************************************************************/
#define EDDSA_SHIFT_DBG_DECOMP_CURR_STATE            28
#define EDDSA_MASK_DBG_DECOMP_CURR_STATE             ((u32)0x0000000F << 28)                             /*!<R 0  fsm signal in decoding module */
#define EDDSA_SHIFT_DBG_REG_ENG_RST                  27
#define EDDSA_BIT_DBG_REG_ENG_RST                    ((u32)0x00000001 << 27)                             /*!<R 0  reset signal in top module */
#define EDDSA_SHIFT_DBG_ENG_FINISH                   26
#define EDDSA_BIT_DBG_ENG_FINISH                     ((u32)0x00000001 << 26)                             /*!<R 0  fsm signal in top module */
#define EDDSA_SHIFT_DBG_FUNC_CURR_STATE              22
#define EDDSA_MASK_DBG_FUNC_CURR_STATE               ((u32)0x0000000F << 22)                             /*!<R 0  function fsm signal in top module */
#define EDDSA_SHIFT_DBG_CURR_STATE                   18
#define EDDSA_MASK_DBG_CURR_STATE                    ((u32)0x0000000F << 18)                             /*!<R 0  fsm signal in top module */
#define EDDSA_SHIFT_DBG_ADD_1_FINISH                 17
#define EDDSA_BIT_DBG_ADD_1_FINISH                   ((u32)0x00000001 << 17)                             /*!<R 0  finish signal in add_1 module */
#define EDDSA_SHIFT_DBG_ADD_2_FINISH                 16
#define EDDSA_BIT_DBG_ADD_2_FINISH                   ((u32)0x00000001 << 16)                             /*!<R 0  finish signal in add_2 module */
#define EDDSA_SHIFT_DBG_ADD_1_CURR_STATE             12
#define EDDSA_MASK_DBG_ADD_1_CURR_STATE              ((u32)0x0000000F << 12)                             /*!<R 0  fsm signal in add_1module */
#define EDDSA_SHIFT_DBG_ADD_1_MUL_1_FINISH           11
#define EDDSA_BIT_DBG_ADD_1_MUL_1_FINISH             ((u32)0x00000001 << 11)                             /*!<R 0  mul finish signal in add_1 module */
#define EDDSA_SHIFT_DBG_ADD_1_MUL_2_FINISH           10
#define EDDSA_BIT_DBG_ADD_1_MUL_2_FINISH             ((u32)0x00000001 << 10)                             /*!<R 0  mul finish signal in add_1 module */
#define EDDSA_SHIFT_DBG_ADD_1_INV_1_FINISH           9
#define EDDSA_BIT_DBG_ADD_1_INV_1_FINISH             ((u32)0x00000001 << 9)                              /*!<R 0  inv module finish signal in add_1 module */
#define EDDSA_SHIFT_DBG_ADD_1_INV_2_FINISH           8
#define EDDSA_BIT_DBG_ADD_1_INV_2_FINISH             ((u32)0x00000001 << 8)                              /*!<R 0  inv module finish signal in add_1 module */
#define EDDSA_SHIFT_DBG_ADD_2_CURR_STATE             4
#define EDDSA_MASK_DBG_ADD_2_CURR_STATE              ((u32)0x0000000F << 4)                              /*!<R 0  fsm signal in add_2 module */
#define EDDSA_SHIFT_DBG_ADD_2_MUL_1_FINISH           3
#define EDDSA_BIT_DBG_ADD_2_MUL_1_FINISH             ((u32)0x00000001 << 3)                              /*!<R 0  mul finish signal in add_2 module */
#define EDDSA_SHIFT_DBG_ADD_2_MUL_2_FINISH           2
#define EDDSA_BIT_DBG_ADD_2_MUL_2_FINISH             ((u32)0x00000001 << 2)                              /*!<R 0  mul finish signal in add_2 module */
#define EDDSA_SHIFT_DBG_ADD_2_INV_1_FINISH           1
#define EDDSA_BIT_DBG_ADD_2_INV_1_FINISH             ((u32)0x00000001 << 1)                              /*!<R 0  inv module finish signal in add_2 module */
#define EDDSA_SHIFT_DBG_ADD_2_INV_2_FINISH           0
#define EDDSA_BIT_DBG_ADD_2_INV_2_FINISH             ((u32)0x00000001 << 0)                              /*!<R 0  inv module finish signal in add_2 module */
/** @} */

