Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_eddsa_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_EDDSA
 * @{
 * @brief rtl8735b_EDDSA Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t EDDSA_ENG_INIT_REG ;                     /*!<  EdDSA Engine Initial Setting Register register,  Address offset: 0x000 */
	__IO uint32_t EDDSA_ENG_RESV0_REG ;                    /*!<  EdDSA Engine reserved0 Register register,  Address offset: 0x004 */
	__IO uint32_t EDDSA_ENG_CONF_INT_REG ;                 /*!<  EdDSA Engine Configure Interrupt Register register,  Address offset: 0x008 */
	__IO uint32_t EDDSA_ENG_CTRL_REG ;                     /*!<  EdDSA Engine Contol Register register,  Address offset: 0x00C */
	__IO uint32_t EDDSA_ENG_X1_P0_REG ;                    /*!<  EdDSA Engine X1 Point [31:0] Registers register,  Address offset: 0x010 */
	__IO uint32_t EDDSA_ENG_X1_P1_REG ;                    /*!<  EdDSA Engine X1 Point [63:32] Registers register,  Address offset: 0x014 */
	__IO uint32_t EDDSA_ENG_X1_P2_REG ;                    /*!<  EdDSA Engine X1 Point [95:64] Registers register,  Address offset: 0x018 */
	__IO uint32_t EDDSA_ENG_X1_P3_REG ;                    /*!<  EdDSA Engine X1 Point [127:96] Registers register,  Address offset: 0x01C */
	__IO uint32_t EDDSA_ENG_X1_P4_REG ;                    /*!<  EdDSA Engine X1 Point [159:128] Registers register,  Address offset: 0x020 */
	__IO uint32_t EDDSA_ENG_X1_P5_REG ;                    /*!<  EdDSA Engine X1 Point [191:160] Registers register,  Address offset: 0x024 */
	__IO uint32_t EDDSA_ENG_X1_P6_REG ;                    /*!<  EdDSA Engine X1 Point [223:192] Registers register,  Address offset: 0x028 */
	__IO uint32_t EDDSA_ENG_X1_P7_REG ;                    /*!<  EdDSA Engine X1 Point [255:224] Registers register,  Address offset: 0x02C */
	__IO uint32_t EDDSA_ENG_Y1_P0_REG ;                    /*!<  EdDSA Engine Y1 Point [31:0] Registers register,  Address offset: 0x030 */
	__IO uint32_t EDDSA_ENG_Y1_P1_REG ;                    /*!<  EdDSA Engine Y1 Point [63:32] Registers register,  Address offset: 0x034 */
	__IO uint32_t EDDSA_ENG_Y1_P2_REG ;                    /*!<  EdDSA Engine Y1 Point [95:64] Registers register,  Address offset: 0x038 */
	__IO uint32_t EDDSA_ENG_Y1_P3_REG ;                    /*!<  EdDSA Engine Y1 Point [127:96] Registers register,  Address offset: 0x03C */
	__IO uint32_t EDDSA_ENG_Y1_P4_REG ;                    /*!<  EdDSA Engine Y1 Point [159:128] Registers register,  Address offset: 0x040 */
	__IO uint32_t EDDSA_ENG_Y1_P5_REG ;                    /*!<  EdDSA Engine Y1 Point [191:160] Registers register,  Address offset: 0x044 */
	__IO uint32_t EDDSA_ENG_Y1_P6_REG ;                    /*!<  EdDSA Engine Y1 Point [223:192] Registers register,  Address offset: 0x048 */
	__IO uint32_t EDDSA_ENG_Y1_P7_REG ;                    /*!<  EdDSA Engine Y1 Point [255:224] Registers register,  Address offset: 0x04C */
	__IO uint32_t EDDSA_ENG_X2_P0_REG ;                    /*!<  EdDSA Engine X2 Point [31:0] Registers register,  Address offset: 0x050 */
	__IO uint32_t EDDSA_ENG_X2_P1_REG ;                    /*!<  EdDSA Engine X2 Point [63:32] Registers register,  Address offset: 0x054 */
	__IO uint32_t EDDSA_ENG_X2_P2_REG ;                    /*!<  EdDSA Engine X2 Point [95:64] Registers register,  Address offset: 0x058 */
	__IO uint32_t EDDSA_ENG_X2_P3_REG ;                    /*!<  EdDSA Engine X2 Point [127:96] Registers register,  Address offset: 0x05C */
	__IO uint32_t EDDSA_ENG_X2_P4_REG ;                    /*!<  EdDSA Engine X2 Point [159:128] Registers register,  Address offset: 0x060 */
	__IO uint32_t EDDSA_ENG_X2_P5_REG ;                    /*!<  EdDSA Engine X2 Point [191:160] Registers register,  Address offset: 0x064 */
	__IO uint32_t EDDSA_ENG_X2_P6_REG ;                    /*!<  EdDSA Engine X2 Point [223:192] Registers register,  Address offset: 0x068 */
	__IO uint32_t EDDSA_ENG_X2_P7_REG ;                    /*!<  EdDSA Engine X2 Point [255:224] Registers register,  Address offset: 0x06C */
	__IO uint32_t EDDSA_ENG_Y2_P0_REG ;                    /*!<  EdDSA Engine Y2 Point [31:0] Registers register,  Address offset: 0x070 */
	__IO uint32_t EDDSA_ENG_Y2_P1_REG ;                    /*!<  EdDSA Engine Y2 Point [63:32] Registers register,  Address offset: 0x074 */
	__IO uint32_t EDDSA_ENG_Y2_P2_REG ;                    /*!<  EdDSA Engine Y2 Point [95:64] Registers register,  Address offset: 0x078 */
	__IO uint32_t EDDSA_ENG_Y2_P3_REG ;                    /*!<  EdDSA Engine Y2 Point [127:96] Registers register,  Address offset: 0x07C */
	__IO uint32_t EDDSA_ENG_Y2_P4_REG ;                    /*!<  EdDSA Engine Y2 Point [159:128] Registers register,  Address offset: 0x080 */
	__IO uint32_t EDDSA_ENG_Y2_P5_REG ;                    /*!<  EdDSA Engine Y2 Point [191:160] Registers register,  Address offset: 0x084 */
	__IO uint32_t EDDSA_ENG_Y2_P6_REG ;                    /*!<  EdDSA Engine Y2 Point [223:192] Registers register,  Address offset: 0x088 */
	__IO uint32_t EDDSA_ENG_Y2_P7_REG ;                    /*!<  EdDSA Engine Y2 Point [255:224] Registers register,  Address offset: 0x08C */
	__IO uint32_t EDDSA_ENG_XO1_P0_REG ;                   /*!<  EdDSA Engine X1 Output Point [31:0] Registers register,  Address offset: 0x090 */
	__IO uint32_t EDDSA_ENG_XO1_P1_REG ;                   /*!<  EdDSA Engine X1 Output Point [63:32] Registers register,  Address offset: 0x094 */
	__IO uint32_t EDDSA_ENG_XO1_P2_REG ;                   /*!<  EdDSA Engine X1 Output Point [95:64] Registers register,  Address offset: 0x098 */
	__IO uint32_t EDDSA_ENG_XO1_P3_REG ;                   /*!<  EdDSA Engine X1 Output Point [127:96] Registers register,  Address offset: 0x09C */
	__IO uint32_t EDDSA_ENG_XO1_P4_REG ;                   /*!<  EdDSA Engine X1 Output Point [159:128] Registers register,  Address offset: 0x0A0 */
	__IO uint32_t EDDSA_ENG_XO1_P5_REG ;                   /*!<  EdDSA Engine X1 Ouput Point [191:160] Registers register,  Address offset: 0x0A4 */
	__IO uint32_t EDDSA_ENG_XO1_P6_REG ;                   /*!<  EdDSA Engine X1 Output Point [223:192] Registers register,  Address offset: 0x0A8 */
	__IO uint32_t EDDSA_ENG_XO1_P7_REG ;                   /*!<  EdDSA Engine X1 Output Point [255:224] Registers register,  Address offset: 0x0AC */
	__IO uint32_t EDDSA_ENG_YO1_P0_REG ;                   /*!<  EdDSA Engine Y1 Output Point [31:0] Registers register,  Address offset: 0x0B0 */
	__IO uint32_t EDDSA_ENG_YO1_P1_REG ;                   /*!<  EdDSA Engine Y1 Output Point [63:32] Registers register,  Address offset: 0x0B4 */
	__IO uint32_t EDDSA_ENG_YO1_P2_REG ;                   /*!<  EdDSA Engine Y1 Output Point [95:64] Registers register,  Address offset: 0x0B8 */
	__IO uint32_t EDDSA_ENG_YO1_P3_REG ;                   /*!<  EdDSA Engine Y1 Output Point [127:96] Registers register,  Address offset: 0x0BC */
	__IO uint32_t EDDSA_ENG_YO1_P4_REG ;                   /*!<  EdDSA Engine Y1 Output Point [159:128] Registers register,  Address offset: 0x0C0 */
	__IO uint32_t EDDSA_ENG_YO1_P5_REG ;                   /*!<  EdDSA Engine Y1 Ouput Point [191:160] Registers register,  Address offset: 0x0C4 */
	__IO uint32_t EDDSA_ENG_YO1_P6_REG ;                   /*!<  EdDSA Engine Y1 Output Point [223:192] Registers register,  Address offset: 0x0C8 */
	__IO uint32_t EDDSA_ENG_YO1_P7_REG ;                   /*!<  EdDSA Engine Y1 Output Point [255:224] Registers register,  Address offset: 0x0CC */
	__IO uint32_t EDDSA_ENG_XO2_P0_REG ;                   /*!<  EdDSA Engine X2 Output Point [31:0] Registers register,  Address offset: 0x0D0 */
	__IO uint32_t EDDSA_ENG_XO2_P1_REG ;                   /*!<  EdDSA Engine X2 Output Point [63:32] Registers register,  Address offset: 0x0D4 */
	__IO uint32_t EDDSA_ENG_XO2_P2_REG ;                   /*!<  EdDSA Engine X2 Output Point [95:64] Registers register,  Address offset: 0x0D8 */
	__IO uint32_t EDDSA_ENG_XO2_P3_REG ;                   /*!<  EdDSA Engine X2 Output Point [127:96] Registers register,  Address offset: 0x0DC */
	__IO uint32_t EDDSA_ENG_XO2_P4_REG ;                   /*!<  EdDSA Engine X2 Output Point [159:128] Registers register,  Address offset: 0x0E0 */
	__IO uint32_t EDDSA_ENG_XO2_P5_REG ;                   /*!<  EdDSA Engine X2 Ouput Point [191:160] Registers register,  Address offset: 0x0E4 */
	__IO uint32_t EDDSA_ENG_XO2_P6_REG ;                   /*!<  EdDSA Engine X2 Output Point [223:192] Registers register,  Address offset: 0x0E8 */
	__IO uint32_t EDDSA_ENG_XO2_P7_REG ;                   /*!<  EdDSA Engine X2 Output Point [255:224] Registers register,  Address offset: 0x0EC */
	__IO uint32_t EDDSA_ENG_YO2_P0_REG ;                   /*!<  EdDSA Engine Y2 Output Point [31:0] Registers register,  Address offset: 0x0F0 */
	__IO uint32_t EDDSA_ENG_YO2_P1_REG ;                   /*!<  EdDSA Engine Y2 Output Point [63:32] Registers register,  Address offset: 0x0F4 */
	__IO uint32_t EDDSA_ENG_YO2_P2_REG ;                   /*!<  EdDSA Engine Y2 Output Point [95:64] Registers register,  Address offset: 0x0F8 */
	__IO uint32_t EDDSA_ENG_YO2_P3_REG ;                   /*!<  EdDSA Engine Y2 Output Point [127:96] Registers register,  Address offset: 0x0FC */
	__IO uint32_t EDDSA_ENG_YO2_P4_REG ;                   /*!<  EdDSA Engine Y2 Output Point [159:128] Registers register,  Address offset: 0x100 */
	__IO uint32_t EDDSA_ENG_YO2_P5_REG ;                   /*!<  EdDSA Engine Y2 Ouput Point [191:160] Registers register,  Address offset: 0x104 */
	__IO uint32_t EDDSA_ENG_YO2_P6_REG ;                   /*!<  EdDSA Engine Y2 Output Point [223:192] Registers register,  Address offset: 0x108 */
	__IO uint32_t EDDSA_ENG_YO2_P7_REG ;                   /*!<  EdDSA Engine Y2 Output Point [255:224] Registers register,  Address offset: 0x10C */
	__IO uint32_t RSVD0[60];                               /*!<  Reserved,  Address offset:0x110-0x1FC */
	__I  uint32_t EDDSA_ENG_DBG_OUTPUT_REG ;               /*!<  EdDSA Engine Debug Output Register register,            Address offset: 0x200 */
} EDDSA_TypeDef;
/** @} */

#endif
